practicando-recursion-usando-first-rest-soluciones.org
#+TITLE: Practicando recursión usando first y rest (Soluciones)
#+PROPERTY: header-args :results  output  :noweb yes :exports both    
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup  

* Cómo ejecutar los ejercicios

 - Crear un archivo con extensión .js 
 - Copiar el código del ejercicio en el archivo 
 - Ejecutar en la línea de comandos:  

#+begin_src sh
node archivo.js 
#+end_src

* first y rest
  Utilizando la sintaxis de asignación de desestructuración podemos obtener el "primer elemento de un arreglo" 
y "el resto del arreglo". El uso de "first y rest" hace que sea más fácil pensar 
recursivamente. 


#+begin_src js
let arr = [1,2,3,4]
let [first, ...rest] = arr;

console.log('first: ', first); 
console.log('rest:  ', rest);  
#+end_src

#+RESULTS:
: first:  1
: rest:   [ 2, 3, 4 ]

* check
  La función check es sólo un wrapper para assert (Node.js)

#+NAME: check 
#+begin_src js :tangle ./check.js 
'use strict';
const assert = require("assert");
function check(message) {
  return  { 
   fn(fnToCheck) { 
      return  {
          toBe: {
            msg   :  message != undefined ? message :  '',
            actual: fnToCheck,
            fnExeAssert(fnAssert,actual, expected) {
              try {
                  fnAssert(actual, expected);
                  console.log('PASS:   ' + this.msg + '\n' );
               } catch(e) {
                  console.log('FAIL:   ' + this.msg );
                  console.log('        expected: ',   e.expected,
                              '\n        actual:   ', e.actual,  '\n');
               }
            },
           deepStrictEqual (expected)  {
              this.fnExeAssert(assert.deepStrictEqual, this.actual, expected)
            },
           strictEqual (expected)  {
              this.fnExeAssert(assert.strictEqual, this.actual, expected)
           }
       } 
      } 
    } 
  }  
}
#+end_src

