practicando-recursion-usando-first-rest-soluciones.org
* remove first ocurrence

#+begin_quote
Escriba una función que remueva la primera vez que aparece el número m en un arreglo de números.\\ 
Si m no existe en el arreglo, la función deberá  regresar el arreglo  sin cambios.
#+end_quote

#+NAME: removeFirstOcurrence
#+begin_src js 
<<check>> 

check("removeFirstOcurrence(5, []) regresa un arreglo vacío")
  .fn(removeFirstOcurrence(5, []))
  .toBe
  .deepStrictEqual([]);

check("removeFirstOcurrence(5, [5]) regresa un arreglo vacío")
  .fn(removeFirstOcurrence(5, [5]))
  .toBe
  .deepStrictEqual([]); 

check("removeFirstOcurrence(5, [1]) regresa el arreglo original sin cambios")
  .fn(removeFirstOcurrence(5, [1]))
  .toBe
  .deepStrictEqual([1]);

check("removeFirstOcurrence(5, [5,5]) regresa un arreglo con solo un 5")
  .fn(removeFirstOcurrence(5, [5,5]))
  .toBe
  .deepStrictEqual([5]); 

check("removeFirstOcurrence(5, [1,5,5,2,3]) regresa un arreglo sin el primer 5")
  .fn(removeFirstOcurrence(5, [1,5,5,2,3]))
  .toBe
  .deepStrictEqual([1,5,2,3]);

check( "removeFirstOcurrence(5, [5,1,2,3]) regresa un arreglo sin 5")
  .fn(removeFirstOcurrence(5, [5,1,2,3]))
  .toBe
  .deepStrictEqual([1,2,3]);

check("removeFirstOcurrence(5, [1,2,5,3]) regresa un arreglo sin 5")
  .fn(removeFirstOcurrence(5, [1,2,5,3]))
  .toBe
  .deepStrictEqual([1,2,3]);

check("removeFirstOcurrence(5, [1,2,3,5]) regresa un arreglo sin 5")
  .fn(removeFirstOcurrence(5, [1,2,3,5]))
  .toBe
  .deepStrictEqual([1,2,3]);


/**
 * Elimina la primera vez que aparece el número m en un arreglo de números.
 * Si m no existe en el arreglo, regresa el arreglo original 
 * @param   {number} m   - el número que debe ser eliminado 
 * @param   {array}  arr - el arreglo de números 
 * @returns {array}      - el arreglo sin m o el arreglo original 
 */
function removeFirstOcurrence(m, arr) {
   if(arr.length === 0 ) return [] 
   let [first, ...rest] = arr;
   
   if(m === first) {
    return rest;
   } else {
    let a =  removeFirstOcurrence(m, rest);
    a.unshift(first);
    return a;
   }
}
#+end_src

#+RESULTS: removeFirstOcurrence
#+begin_example
PASS:   removeFirstOcurrence(5, []) regresa un arreglo vacío

PASS:   removeFirstOcurrence(5, [5]) regresa un arreglo vacío

PASS:   removeFirstOcurrence(5, [1]) regresa el arreglo original sin cambios

PASS:   removeFirstOcurrence(5, [5,5]) regresa un arreglo con solo un 5

PASS:   removeFirstOcurrence(5, [1,5,5,2,3]) regresa un arreglo sin el primer 5

PASS:   removeFirstOcurrence(5, [5,1,2,3]) regresa un arreglo sin 5

PASS:   removeFirstOcurrence(5, [1,2,5,3]) regresa un arreglo sin 5

PASS:   removeFirstOcurrence(5, [1,2,3,5]) regresa un arreglo sin 5

#+end_example


