practicando-recursion-usando-first-rest-soluciones.html

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, []) regresa un arreglo vac&#237;o"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, []<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [5]) regresa un arreglo vac&#237;o"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[]<span style="color: #c678dd; font-weight: bold;">)</span>; 

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1]) regresa el arreglo original sin cambios"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [5,5]) regresa un arreglo con solo un 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5,5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[5]<span style="color: #c678dd; font-weight: bold;">)</span>; 

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,5,5,2,3]) regresa un arreglo sin el primer 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,5,5,2,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,5,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span> <span style="color: #98be65;">"removeFirstOcurrence(5, [5,1,2,3]) regresa un arreglo sin 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [5,1,2,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,2,5,3]) regresa un arreglo sin 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,2,5,3]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;

check<span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #98be65;">"removeFirstOcurrence(5, [1,2,3,5]) regresa un arreglo sin 5"</span><span style="color: #c678dd; font-weight: bold;">)</span>
  .fn<span style="color: #c678dd; font-weight: bold;">(</span>removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>5, [1,2,3,5]<span style="color: #c678dd; font-weight: bold;">))</span>
  .toBe
  .deepStrictEqual<span style="color: #c678dd; font-weight: bold;">(</span>[1,2,3]<span style="color: #c678dd; font-weight: bold;">)</span>;


<span style="color: #9eac8c;">/**</span>
<span style="color: #9eac8c;"> * Elimina la primera vez que aparece el n&#250;mero m en un arreglo de n&#250;meros.</span>
<span style="color: #9eac8c;"> * Si m no existe en el arreglo, regresa el arreglo original </span>
<span style="color: #9eac8c;"> * @param   {number} m   - el n&#250;mero que debe ser eliminado </span>
<span style="color: #9eac8c;"> * @param   {array}  arr - el arreglo de n&#250;meros </span>
<span style="color: #9eac8c;"> * @returns {array}      - el arreglo sin m o el arreglo original </span>
<span style="color: #9eac8c;"> */</span>
<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">removeFirstOcurrence</span><span style="color: #c678dd; font-weight: bold;">(</span><span style="color: #61afef;">m</span>, <span style="color: #61afef;">arr</span><span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">{</span>
   <span style="color: #c678dd; font-weight: bold;">if(</span>arr.length === 0 <span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">return</span> [] 
   <span style="color: #c678dd; font-weight: bold;">const</span> [first, ...rest] = arr;

   <span style="color: #c678dd; font-weight: bold;">if(</span>m === first<span style="color: #c678dd; font-weight: bold;">)</span> <span style="color: #c678dd; font-weight: bold;">{</span>
    <span style="color: #c678dd; font-weight: bold;">return</span> rest;
   <span style="color: #c678dd; font-weight: bold;">}</span> <span style="color: #c678dd; font-weight: bold;">else</span> <span style="color: #c678dd; font-weight: bold;">{</span>
    <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">a</span> =  removeFirstOcurrence<span style="color: #c678dd; font-weight: bold;">(</span>m, rest<span style="color: #c678dd; font-weight: bold;">)</span>;
    a.unshift<span style="color: #c678dd; font-weight: bold;">(</span>first<span style="color: #c678dd; font-weight: bold;">)</span>;
    <span style="color: #c678dd; font-weight: bold;">return</span> a;
   <span style="color: #c678dd; font-weight: bold;">}</span>
<span style="color: #c678dd; font-weight: bold;">}</span>
</pre>
</div>

<pre class="example">
PASS:   removeFirstOcurrence(5, []) regresa un arreglo vacío

PASS:   removeFirstOcurrence(5, [5]) regresa un arreglo vacío

PASS:   removeFirstOcurrence(5, [1]) regresa el arreglo original sin cambios

PASS:   removeFirstOcurrence(5, [5,5]) regresa un arreglo con solo un 5

PASS:   removeFirstOcurrence(5, [1,5,5,2,3]) regresa un arreglo sin el primer 5

PASS:   removeFirstOcurrence(5, [5,1,2,3]) regresa un arreglo sin 5

PASS:   removeFirstOcurrence(5, [1,2,5,3]) regresa un arreglo sin 5

PASS:   removeFirstOcurrence(5, [1,2,3,5]) regresa un arreglo sin 5

</pre>
</div>
</div>
