practicando-recursion-usando-first-rest-soluciones.org
* sum

#+begin_quote
Escriba una función que sume todos los números en un arreglo.\\
Si el arreglo está vacío, la función deberá regresar 0.
#+end_quote
  
#+begin_src js
<<check>> 

check("sum([0] regresa 0")
  .fn(sum([0]))
  .toBe
  .strictEqual(0);

check("sum([1] regresa 1")
  .fn(sum([1]))
  .toBe
  .strictEqual(1);

check("sum([0,1] regresa 1")
  .fn(sum([0,1]))
  .toBe
  .strictEqual(1);

check("sum([1,2] regresa 3")
  .fn(sum([1,2]))
  .toBe
  .strictEqual(3);

check("sum([1,-1] regresa 0")
  .fn(sum([1,-1]))
  .toBe
  .strictEqual(0);

/**
 * Regresa la suma de todos los números en un arreglo
 * Si el arreglo está vacío, regresa 0
 * @param {array}  arr  - el arreglo de números 
 * @returns {number}    - la suma de todos los números del arreglo o cero 
 */
function sum(arr) {
 if(arr.length === 0) return 0;
 let [first, ...rest] = arr; 
 return first + sum(rest);
}
#+END_src

#+RESULTS:
#+begin_example
PASS:   sum([0] regresa 0

PASS:   sum([1] regresa 1

PASS:   sum([0,1] regresa 1

PASS:   sum([1,2] regresa 3

PASS:   sum([1,-1] regresa 0

#+end_example

