practicando-recursion-usando-first-rest-soluciones.org
* countChar 

#+begin_quote
Escriba una función que cuente el número de veces que un carácter aparece en una cadena de caracteres.\\
Si el carácter no existe en la cadena la función deberá regresar  0. 

#+end_quote


#+begin_src js
<<check>>

check("countChar('h', 'ayzayzzz') regresa 0")
  .fn(countChar('h',  'ayzayzzz'))
  .toBe
  .strictEqual(0);

check("countChar('a', 'ayzayzzz') regresa 2")
  .fn(countChar('a',  'ayzayzzz'))
  .toBe
  .strictEqual(2);

check("countChar('y', 'ayzayzzz') regresa 2")
  .fn(countChar('y',  'ayzayzzz'))
  .toBe
  .strictEqual(2);

check("countChar('z', 'ayzayzzz') regresa 4")
  .fn(countChar('z',  'ayzayzzz'))
  .toBe
  .strictEqual(4);

/**
 * Regresa el número de veces que un carácter aparece en una cadena de caracteres. 
 * Si el carácter no existe en la cadena, regresa cero.
 * @param   {string}       c   - el carácter   
 * @param   {string|array} str - cadena en la primera llamada, arreglo en las llamadas recursivas
 * @returns {number}             el número de veces en que el carácter aparece en la cadena o cero
 */
function countChar(c, str) {
 if(str.length === 0 ) return 0 
 let [first, ...rest]  = str;

 return (c === first ) ? 1 + countChar(c, rest) : countChar(c, rest)  
}

#+end_src

#+RESULTS:
: PASS:   countChar('h', 'ayzayzzz') regresa 0
: 
: PASS:   countChar('a', 'ayzayzzz') regresa 2
: 
: PASS:   countChar('y', 'ayzayzzz') regresa 2
: 
: PASS:   countChar('z', 'ayzayzzz') regresa 4
: 

