practicando-recursion-usando-first-rest-soluciones.org
* len

#+begin_quote
Escriba una función que regrese el número de elementos en un arreglo.\\
Si el arreglo está vacío, la función deberá regresar 0.
#+end_quote


#+begin_src js 
<<check>>

check("len([]) regresa 0")
  .fn(len([]))
  .toBe
  .strictEqual(0)

check("len([0]) regresa 1")
  .fn(len([0]))
  .toBe
  .strictEqual(1)

check("len([1,2]) regresa 2")
  .fn(len([1,2]))
  .toBe
  .strictEqual(2)


/**
 * Regresa el número de elementos en un arreglo.
 * Si el arreglo está vacío, regresa 0. 
 * @param {arr} arr  - el arreglo 
 * @returns {number} - el número de elementos en el arreglo o cero 
 */

function len(arr){ 
 if(arr.length === 0) return 0;  
 let [first, ...rest]  = arr;
 return 1 + len(rest);
}
#+end_src

#+RESULTS:
: PASS:   len([]) regresa 0
: 
: PASS:   len([0]) regresa 1
: 
: PASS:   len([1,2]) regresa 2
: 

