practicando-recursion-usando-first-rest-soluciones.org
* max

#+begin_quote
Escriba una función que regrese el número más alto de un arreglo de números.\\ 
Si el arreglo está vacío, la función deberá regresar 0.
#+end_quote

#+begin_src js 
<<check>>

check("max[15,8,3,9] regresa 15")
  .fn(max([15,8,3,9]))
  .toBe
  .strictEqual(15)

check("max[8,15,9] regresa 15")
  .fn(max([8,15,9]))
  .toBe
  .strictEqual(15)

check("max[8,9,15] regresa 15")
  .fn(max([8,9,15]))
  .toBe
  .strictEqual(15)

check("max[14,16, 8,3,9,14] regresa 16")
  .fn(max([14,16, 8,3,9,14]))
  .toBe
  .strictEqual(16)

/**
 * Regresa el número más alto de un arreglo de números. 
 * Si el arreglo está vacío, regresa 0 
 * @param   {array}  arr - el arreglo de números 
 * @returns {number}     - el número más alto del arreglo o cero
 */
function max(arr) {
  if(arr.length === 1 ) { 
    return arr[0];
  } else {
    let [first, ...rest] = arr;
    if (first > rest[0])  {
       rest.shift();
       rest.push(first)
       return max(rest)  
     } else {
       return max(rest)  
     }
  }
}
#+end_src

#+RESULTS:
: PASS:   max[15,8,3,9] regresa 15
: 
: PASS:   max[8,15,9] regresa 15
: 
: PASS:   max[8,9,15] regresa 15
: 
: PASS:   max[14,16, 8,3,9,14] regresa 16
: 


